app/controllers/programs_controller.rb

SELECT * FROM `conditions` WHERE (`conditions`.`id` = 1)
SELECT * FROM `programs` WHERE (`programs`.`id` = 1)
---
  def show
    condition_id = Program.find(params[:id]).condition.id

SELECT * FROM `meals` WHERE (`meals`.`name` = 'Sausage and Peppers') LIMIT 1
SELECT * FROM `conditions` WHERE (`conditions`.`name` = 'Diabetes') LIMIT 1
INSERT INTO `programs` (`meal_id`, `updated_at`, `condition_id`, `created_at`) VALUES(5, '2009-08-19 18:17:16', 3, '2009-08-19 18:17:16')
---
  def create
  @meal = Meal.find_by_name(params[:meal][:name])
  @condition = Condition.find_by_name(params[:condition][:name])
  @program = Program.new
  @program.meal_id = @meal.id
  @program.condition_id = @condition.id
  @program.save()

INSERT INTO `conditions` (`name`, `updated_at`, `created_at`) VALUES(NULL, '2009-08-19 18:16:02', '2009-08-19 18:16:02')
INSERT INTO `meals` (`name`, `updated_at`, `created_at`) VALUES(NULL, '2009-08-19 18:16:02', '2009-08-19 18:16:02')
---
   def new
    @program = Program.new
    @condition = @program.create_condition
    @meal = @program.create_meal